app/controllers/accounts_controller.rb

  def update
      respond_to do |format|
      if @account.update(account_params)
---
UPDATE "accounts" SET "age" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["age", 40], ["updated_at", "2015-04-19 02:12:37.022865"], ["id", 16]]