app/controllers/todolists_controller.rb

INSERT INTO "todolists" ("list_name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["list_name", "List1"], ["user_id", 14], ["created_at", "2015-04-18 17:02:37.266772"], ["updated_at", "2015-04-18 17:02:37.266772"]]
---
  def create
    @todolist = current_user.todolists.new(todolist_params)

    respond_to do |format|
      if @todolist.save

UPDATE "todolists" SET "list_due_date" = ?, "updated_at" = ? WHERE "todolists"."id" = ?  [["list_due_date", "2015-08-07"], ["updated_at", "2015-04-18 23:08:47.216610"], ["id", 21]]
---
  def update
    respond_to do |format|
      if @todolist.update(todolist_params)

DELETE FROM "todolists" WHERE "todolists"."id" = ?  [["id", 21]]
---
  def destroy
    @todolist.destroy