app/controllers/todoitems_controller.rb

  def create
    @todoitem = @todolist.todoitems.new(todolist_params)
    if @todoitem.save
---
INSERT INTO "todoitems" ("task_title", "description", "todolist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def destroy
    @todoitem = @todolist.todoitems.find(params[:id])
    @todoitem.destroy
---
DELETE FROM "tags_todoitems" WHERE "tags_todoitems"."todoitem_id" = ?  [["todoitem_id", 48]]
DELETE FROM "todoitems" WHERE "todoitems"."id" = ?  [["id", 48]]